import matplotlib.pyplot as plt

# Массив с цветами
cats_colors = [
    (255, 0, 0), (0, 0, 255), (0, 128, 0), (255, 255, 0),
    (255, 165, 0), (255, 192, 203), (128, 0, 128),
    (165, 42, 42), (128, 128, 128), (50, 205, 50), (0, 255, 255),
    (255, 0, 255), (128, 128, 0), (0, 128, 128), (0, 0, 128),
    (128, 0, 0), (255, 0, 255),
    (230, 230, 250), (135, 206, 250), (152, 251, 152), (255, 218, 185),
    (255, 182, 193), (240, 128, 128), (255, 255, 224),
    (216, 191, 216), (245, 245, 220), (175, 238, 238), (255, 228, 225),
    (250, 250, 210), (255, 229, 180), (245, 255, 250)
]

# Преобразуем цвета из формата (R, G, B) к формату, который принимает matplotlib (R/255, G/255, B/255)
cats_colors_normalized = [(r/255, g/255, b/255) for r, g, b in cats_colors]

# Создаем фигуру и оси
fig, ax = plt.subplots(1, 1, figsize=(14, 2))

# Устанавливаем пределы осей
ax.set_xlim(0, len(cats_colors))
ax.set_ylim(0, 1)

# Отключаем оси
ax.axis('off')

# Рисуем прямоугольники с цветами
for i, color in enumerate(cats_colors_normalized):
    rect = plt.Rectangle((i, 0), 1, 1, color=color)
    ax.add_patch(rect)

# Отображаем рисунок
plt.show()
